---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegmentArray.ReverseIterator
source: html/3890dad2-3ca3-3f06-e182-7984c316d7e3.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual DimensionSegmentArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.